{
    "auto_mapping": null,
    "base_model_name_or_path": "meta-llama/Llama-3.2-1B",
    "inference_mode": true,
    "num_attention_heads": 32,
    "num_layers": 16,
    "num_transformer_submodules": 1,
    "num_virtual_tokens": 14,
    "peft_type": "PROMPT_TUNING",
    "prompt_tuning_init": "RANDOM",
    "prompt_tuning_init_text": "You are a Rust programmer. RUST_END ends rust function.",
    "revision": null,
    "task_type": "CAUSAL_LM",
    "token_dim": 2048,
    "tokenizer_kwargs": null,
    "tokenizer_name_or_path": "meta-llama/Llama-3.2-1B"
  }